homework/Lab04/combustorRhoPimple_lowT_lowRe/0/U
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.0 0.0 0.0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0.0 10.0 0.0);
    }

    outlet
    {
        type            zeroGradient;
    }

    "(splitter|back|sides)"
    {
        type            noSlip;
    }

    fuel_inlet
    {
        type            fixedValue;
        value           uniform (0.0 15.0 0.0);
    }

    frontAndBack
    {
        type            empty;
    }
}
