homework/Lab04/combustorRhoPimple_lowT_lowRe/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
 =========                |
 \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
  \    /   O peration     | Website:  https://openfoam.org
   \  /    A nd           | Version:  9                                     
    \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           $internalField;
    }

    outlet
    {
        type            calculated;
        value           $internalField;
    }

    "(splitter|back|sides)"
    {
        type            nutkWallFunction;
        value           $internalField;
    }

    fuel_inlet
    {
        type            calculated;
        value           $internalField;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
