homework/Lab04/combustorRhoPimple_lowT_lowRe/0/p
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            waveTransmissive;
        rho             rho;
        gamma           1.4;
        fieldInf        101325;
        lInf            10;
        value           $internalField;
    }

    "(splitter|back|sides)"
    {
        type            zeroGradient;
    }

    fuel_inlet
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
}

