homework/Lab04/combustorRhoPimple_lowT_lowRe/Allrun
#!/bin/sh
cd ${0%/*} || exit 1 

. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh 

runApplication decomposePar -force 

runParallel checkMesh 

runParallel renumberMesh -overwrite 

runParallel $(getApplication)

runApplication reconstructPar -noZero 

runApplication foamToVTK -useTimeName

paraFoam -touch 
